# Seminar 17
- apply function
- iterating over dataframe
- JSON format
- API

## apply function

In [ ]:
import pandas as pd
import numpy as np
!pip install openpyxl
#df_hh1a = pd.read_stata('hh1a.dta')

Requirement already satisfied: openpyxl in /usr/local/lib/python3.6/dist-packages (2.5.9)
Requirement already satisfied: jdcal in /usr/local/lib/python3.6/dist-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in /usr/local/lib/python3.6/dist-packages (from openpyxl) (1.0.1)

In [ ]:
df_hh1a.head()

   hhid  pid    h102  h103m  h103y  ...    h105     h108 h108a h109  h110
0  2001    1    male     11   1973  ...  kyrgyz  married   2.0  yes   NaN
1  2001    2  female      4   1973  ...  kyrgyz  married   1.0  yes   NaN
2  2001    3  female      7   1997  ...  kyrgyz   single   NaN  yes   NaN
3  2001    4    male      2   2002  ...  kyrgyz      NaN   NaN  yes   NaN
4  2001    5    male     11   2006  ...  kyrgyz      NaN   NaN  yes   NaN

[5 rows x 12 columns]

In [ ]:
def labeling(ethn):
  if ethn == 'kyrgyz':
    res = 1
  elif ethn =='uzbek':
    res = 2
  elif ethn =='russian':
    res = 3
  else:
    res = 0
  return res

In [ ]:
df_hh1a['dummy_ethn'] = df_hh1a['h105'].apply(labeling)

In [ ]:
df_hh1a['h105']

0        kyrgyz
1        kyrgyz
2        kyrgyz
3        kyrgyz
4        kyrgyz
          ...
13282     uzbek
13283     uzbek
13284     uzbek
13285     uzbek
13286     uzbek
Name: h105, Length: 13287, dtype: category
Categories (8, object): ['kyrgyz' < 'uzbek' < 'russian' < 'dungan' < 'uigur' < 'tajik' < 'kazakh' < 'other']

In [ ]:
df_hh1a.head()

   hhid  pid    h102  h103m  h103y  ...     h108 h108a h109 h110  dummy_ethn
0  2001    1    male     11   1973  ...  married   2.0  yes  NaN           1
1  2001    2  female      4   1973  ...  married   1.0  yes  NaN           1
2  2001    3  female      7   1997  ...   single   NaN  yes  NaN           1
3  2001    4    male      2   2002  ...      NaN   NaN  yes  NaN           1
4  2001    5    male     11   2006  ...      NaN   NaN  yes  NaN           1

[5 rows x 13 columns]

In [ ]:
def labeling_role(row):
  if row['h102'] == 'male' and row['h104'] == 'head':
    res = 1
  elif row['h102'] == 'female' and row['h104'] == 'head':
    res = 2
  else:
    res = 0
  return res

In [ ]:
df_hh1a['dummy_role'] = df_hh1a.apply(labeling_role, axis = 1)

In [ ]:
df_hh1a.head()

   hhid  pid    h102  h103m  h103y  ...  h110 dummy_ethn dummy_role decade  age
0  2001    1    male     11   1973  ...   NaN          1          1   1970   47
1  2001    2  female      4   1973  ...   NaN          1          0   1970   47
2  2001    3  female      7   1997  ...   NaN          1          0   1990   23
3  2001    4    male      2   2002  ...   NaN          1          0   2000   18
4  2001    5    male     11   2006  ...   NaN          1          0   2000   14

[5 rows x 16 columns]

In [ ]:
def extract_age(row):
  decade = row['h103y'] // 10 * 10
  age = 2020- row['h103y']
  return decade, age

In [ ]:
df_hh1a[['decade','age']]= df_hh1a.apply(extract_age, axis=1, result_type="expand")

In [ ]:
df_hh1a.head()

   hhid  pid    h102  h103m  h103y  ...  h110 dummy_ethn dummy_role decade  age
0  2001    1    male     11   1973  ...   NaN          1          1   1970   47
1  2001    2  female      4   1973  ...   NaN          1          0   1970   47
2  2001    3  female      7   1997  ...   NaN          1          0   1990   23
3  2001    4    male      2   2002  ...   NaN          1          0   2000   18
4  2001    5    male     11   2006  ...   NaN          1          0   2000   14

[5 rows x 16 columns]

## Iterating through dataframe

In [ ]:
ind = 0
for index, row in df_hh1a.iterrows():
  if row['h104'] == 'head' and row['h105'] == 'uzbek':
    print(row['h103y'], index, df_hh1a.iloc[index,0:2])
    ind +=1
  if ind >= 10:
    break

1937 1164 hhid    3028
pid        1
Name: 1164, dtype: object
1964 1166 hhid    3029
pid        1
Name: 1166, dtype: object
1967 1170 hhid    3030
pid        1
Name: 1170, dtype: object
1940 1186 hhid    3032
pid        1
Name: 1186, dtype: object
1957 1189 hhid    3033
pid        1
Name: 1189, dtype: object
1955 1197 hhid    3034
pid        1
Name: 1197, dtype: object
1964 1207 hhid    3035
pid        1
Name: 1207, dtype: object
1930 1211 hhid    3036
pid        1
Name: 1211, dtype: object
1948 1217 hhid    3037
pid        1
Name: 1217, dtype: object
1930 1221 hhid    3038
pid        1
Name: 1221, dtype: object

## Public policy on traffic jams

![traffic jam](https://static.ca-news.org/upload/ennews/3/596613.1505122093.b.jpg)

## JSON 
is a syntax for storing and exchanging data.

JSON is text, written with JavaScript object notation.

[detailed information on JSON](https://www.w3schools.com/python/trypython.asp?filename=demo_json_from_python_separators)

In [ ]:
import json

# some JSON:
x =  '{ "name":"John", "age":30, "city":"New York"}'

# parse x:
y = json.loads(x)

# the result is a Python dictionary:
print(y["age"])

30

You can convert Python objects of the following types, into JSON strings:

- dict
- list
- tuple
- string
- int
- float
- True
- False
- None

In [ ]:
print(json.dumps({"name": "John", "age": 30}))
print(json.dumps(["apple", "bananas"]))
print(json.dumps(("apple", "bananas")))
print(json.dumps("hello"))
print(json.dumps(42))
print(json.dumps(31.76))
print(json.dumps(True))
print(json.dumps(False))
print(json.dumps(None))

{"name": "John", "age": 30}
["apple", "bananas"]
["apple", "bananas"]
"hello"
42
31.76
true
false
null

In [ ]:
x = {
  "name": "John",
  "age": 30,
  "married": True,
  "divorced": False,
  "children": ("Ann","Billy"),
  "pets": None,
  "cars": [
    {"model": "BMW 230", "mpg": 27.5},
    {"model": "Ford Edge", "mpg": 24.1}
  ]
}

# use . and a space to separate objects, and a space, a = and a space to separate keys from their values:
print(json.dumps(x, indent=4, separators=(",", " : ")))

{
    "name" : "John",
    "age" : 30,
    "married" : true,
    "divorced" : false,
    "children" : [
        "Ann",
        "Billy"
    ],
    "pets" : null,
    "cars" : [
        {
            "model" : "BMW 230",
            "mpg" : 27.5
        },
        {
            "model" : "Ford Edge",
            "mpg" : 24.1
        }
    ]
}

## Google Maps API

In [ ]:
import requests
from urllib.parse import urlencode

In [ ]:
api_key = "PUT_YOUR_API_KEY_HERE"
main_url = "https://maps.googleapis.com/maps/api/distancematrix/json?"
params = {"units":"imperial", "origins":"42.8436070917288,74.58590424192214", "destinations":"42.85760268959256,74.58680642587052", "key":api_key}
url_params = urlencode(params)
url = main_url+url_params
print(url)

https://maps.googleapis.com/maps/api/distancematrix/json?units=imperial&origins=42.8436070917288%2C74.58590424192214&destinations=42.85760268959256%2C74.58680642587052&key=AIzaSyD4ZOa2_V7P9eLX1K9lBRU4odn1IHs4Fk4

In [ ]:
r = requests.get(url)
data = r.json()

In [ ]:
print(data)

{'destination_addresses': ['22 Prospekt Mira, Bishkek, Kyrgyzstan'], 'origin_addresses': ['55 Mir Ave, Bishkek, Kyrgyzstan'], 'rows': [{'elements': [{'distance': {'text': '1.0 mi', 'value': 1569}, 'duration': {'text': '4 mins', 'value': 222}, 'status': 'OK'}]}], 'status': 'OK'}

In [ ]:
data['rows'][0]['elements'][0]['duration']['value']

222

In [ ]:
def req_time():
  api_key = "PUT_YOUR_API_KEY_HERE"
  main_url = "https://maps.googleapis.com/maps/api/distancematrix/json?"
  params = {"units":"imperial", "origins":"42.843598214768264,74.58599297475833", "destinations":"42.87660314464833,74.58820649718756", "key":api_key}
  url_params = urlencode(params)
  url = main_url+url_params
  r = requests.get(url)
  data = r.json()
  res = data['rows'][0]['elements'][0]['duration']['value']
  return res

In [ ]:
import time
while True:
    # code goes here
    time.sleep(10)

In [ ]:
from openpyxl import load_workbook
res = [req_time()]
wb = load_workbook("test.xlsx")
ws = wb.worksheets[0]
ws.append(res)
wb.save("test.xlsx")

In [ ]:
from openpyxl import load_workbook
import time
while True:
  res = [req_time()]
  wb = load_workbook("test.xlsx")
  ws = wb.worksheets[0]
  ws.append(res)
  wb.save("test.xlsx")
  time.sleep(600)

KeyboardInterrupt: ignored